list_season = ['', 'Зима', 'Зима', 'Весна', 'Весна', 'Весна', 'Лето', 'Лето', 'Лето', 'Осень', 'Осень', 'Осень', 'Зима']
dict_season = {
    1: 'Зима',
    2: 'Зима',
    3: 'Весна',
    4: 'Весна',
    5: 'Весна',
    6: 'Лето',
    7: 'Лето',
    8: 'Лето',
    9: 'Осень',
    10: 'Осень',
    11: 'Осень',
    12: 'Зима'
}
while True:
    num = int(input('Введите номер месяца: '))
    if 0 < num < 13:
        print(f'Это {list_season[num]}')
        print(f'Это {dict_season.get(num)}')
        break
    else:
        print(f'Месяца с номером {num} не существует.')
